deniskim82/BT_HID_Proxy/sdkconfig.defaults
# BT HID Proxy - SDK Configuration Defaults
# Target: M5Stamp Pico (ESP32-PICO-D4)
# BLE-only rewrite: NimBLE host, Bluedroid and BT Classic removed.

# -----------------------------------
# Target Selection
# -----------------------------------
CONFIG_IDF_TARGET="esp32"

# -----------------------------------
# Partition Table
# -----------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# -----------------------------------
# Bluetooth: NimBLE, BLE-only controller
# -----------------------------------
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y

CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
CONFIG_BTDM_CTRL_BLE_MAX_CONN=1

# Central-only host: no advertising, no peripheral role
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n

CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=5
CONFIG_BT_NIMBLE_MAX_CCCDS=16

# Persist bonds (LTK/IRK) in NVS so reconnection after power cycle works
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# Security Manager: legacy + secure connections
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y

# -----------------------------------
# FreeRTOS
# -----------------------------------
CONFIG_FREERTOS_HZ=1000

# -----------------------------------
# Logging
# -----------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# -----------------------------------
# Watchdog
# -----------------------------------
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# -----------------------------------
# Power Management
# -----------------------------------
CONFIG_PM_ENABLE=n
